# IFCProperty Mapping Info Export Flag Property

Source: https://www.revitapidocs.com/2026/5d048701-3e7f-3113-9ec9-00338f681c1d.htm

---

| IFCProperty Mapping Info Export Flag Property |
| --- |

Whether or not the property is included in export.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool ExportFlag { get; set; }
```

```
Public Property ExportFlag As Boolean
	Get
	Set
```

```
public:
property bool ExportFlag {
	bool get ();
	void set (bool value);
}
```

```
member ExportFlag : bool with get, set
```

#### Property Value

Boolean See Also

#### Reference

IFCPropertyMappingInfo Class Autodesk.Revit.DB Namespace